#include <iostream>
#include <windows.h>
using namespace std;
void Clear() {
	system("cls");
}
void ColorText(int menu) {
	cout << "[-] Здесь вы можете изменить цвет текста в консоли. " << endl;
	cout << "[-] Выберите один из предложенных цветов \n[1] Синий \n[2] Зеленый \n[3] Голубой \n[4] Красный \n[5] Пурпурный \n[6] Желтый \n[7] Белый \n[8] Светло-серый \n[9] Светло-синий" << endl;
	cin >> menu;
	if (menu == 1) {
		system("color 1");

	}
	else if (menu == 2) {
		system("color 2");

	}
	else if (menu == 3) {
		system("color 3");

	}
	else if (menu == 4) {
		system("color 4");

	}
	else if (menu == 5) {
		system("color 5");

	}
	else if (menu == 6) {
		system("color 6");

	}
	else if (menu == 7) {
		system("color 7");

	}
	else if (menu == 8) {
		system("color 8");

	}
	else if (menu == 9) {
		system("color 9");

	}
	else {
		cout << "Неверно введено значение.";
	}
}
void ColorBackground() {
	cout << "[-] Здесь вы можете изменить цвет фона в консоли. " << endl;
	cout << "[-] Выберите один из предложенных цветов \n[1] Синий \n[2] Зеленый \n[3] Голубой \n[4] Красный \n[5] Пурпурный \n[6] Желтый \n[7] Белый \n[8] Светло-серый \n[9] Светло-синий" << endl;
	int menu;
	cin >> menu;
	if (menu == 1) {
		system("color 10");
	}
	else if (menu == 2) {
		system("color 20");
	}
	else if (menu == 3) {
		system("color 30");
	}
	else if (menu == 4) {
		system("color 40");
	}
	else if (menu == 5) {
		system("color 50");
	}
	else if (menu == 6) {
		system("color 60");
	}
	else if (menu == 7) {
		system("color 70");
	}
	else if (menu == 8) {
		system("color 80");
	}
	else if (menu == 9) {
		system("color 90");
	}
	else {
		cout << "Неверно введено значение.";
	}
}
void SizeInt() {
	cout << "[=] В типе данных Int " << sizeof(int) << " байт" << endl;
}
void SizeChar() {
	cout << "[=] В типе данных Char " << sizeof(char) << " байт" << endl;
}
void SizeDouble() {
	cout << "[=] В типе данных Double " << sizeof(double) << " байт" << endl;
}
void SizeFloat() {
	cout << "[=] В типе данных Float " << sizeof(float) << " байт" << endl;
}
void SizeBool() {
	cout << "[=] В типе данных Bool " << sizeof(bool) << " байт" << endl;
}
void hello() {
	cout << "[!] Приветствуем в программе Функции " << endl;
}
void square() {
	for (int i = 0; i < 5; i++) {
		for (int i = 0; i < 5; i++) {
			cout << " $ ";
		}
		cout << endl;
	}
}
void maze() {
	const int value = 30;
	int arr2[value][value] = {
	{1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
	{1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,1},
	{1,1,0,0,0,0,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,0,0,0,0,0,1,1,0,1},
	{1,0,0,0,1,0,0,0,0,0,1,1,1,0,0,0,0,0,0,1,1,0,1,1,1,0,1,0,0,1},
	{1,0,1,0,1,0,1,1,1,0,1,0,0,0,1,1,0,1,0,1,0,0,0,1,1,0,0,0,1,1},
	{1,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,0,1,0,0,0,1,0,0,0,0,1,0,1,1},
	{1,1,1,0,1,1,1,0,1,1,1,0,1,1,1,0,1,1,1,0,1,1,1,1,0,1,1,0,0,1},
	{1,1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,0,1,0,0,0,0,0,1,1},
	{1,0,0,1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,1,1,0,0,0,1,1,1,1,1,1},
	{1,0,1,1,1,1,0,1,1,1,0,1,0,1,1,1,1,0,1,1,1,0,1,1,1,0,0,0,0,1},
	{1,0,0,0,0,1,0,0,0,1,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,1},
	{1,1,1,1,0,1,1,1,0,0,0,1,0,0,0,0,0,1,1,1,1,1,1,1,1,0,1,0,0,1},
	{1,0,1,1,1,1,1,1,1,1,0,0,0,1,1,1,0,0,0,0,1,1,1,1,1,0,0,0,1,1},
	{1,0,0,0,0,0,0,0,0,1,1,1,0,1,0,0,0,1,1,0,1,1,0,0,0,0,1,1,1,1},
	{1,0,1,0,1,1,0,1,0,0,1,1,0,1,0,1,0,0,1,0,0,0,1,0,1,0,1,1,1,1},
	{1,0,1,0,0,1,0,1,1,0,0,0,0,0,0,1,1,0,1,1,1,0,1,0,1,0,0,1,1,1},
	{1,0,1,1,0,1,0,0,1,1,1,0,1,1,0,1,0,0,1,1,1,0,0,0,1,0,1,1,1,1},
	{1,0,0,1,1,1,1,0,0,0,1,0,0,1,1,1,0,1,1,1,1,1,0,1,1,0,1,1,1,1},
	{1,1,0,0,0,0,0,0,1,0,0,0,0,0,0,1,1,1,1,1,1,1,0,0,0,0,1,0,1,1},
	{1,1,1,1,1,1,0,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,0,1,1,0,1,1},
	{1,1,1,1,1,1,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,1,1},
	{1,0,0,0,0,0,0,1,0,0,0,0,0,0,1,1,1,1,1,1,0,0,0,0,0,0,0,1,1,1},
	{1,1,0,0,1,1,1,1,1,1,1,0,1,0,0,0,0,1,0,0,0,1,1,0,1,1,0,0,1,1},
	{1,0,0,1,1,1,1,0,0,0,0,0,1,1,1,1,0,0,0,1,1,1,1,0,0,0,0,0,1,1},
	{1,0,1,1,0,0,0,0,1,1,1,0,0,0,0,0,0,1,0,0,0,0,0,0,1,1,1,1,1,1},
	{1,1,1,0,0,1,1,1,1,0,0,0,1,1,1,1,0,1,1,1,1,1,0,1,1,0,0,0,0,1},
	{1,0,0,0,1,1,0,0,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,1,0,1},
	{1,0,1,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,1,0,0,0,1},
	{1,0,1,1,1,1,1,1,0,1,1,0,1,1,1,1,1,1,0,0,0,0,1,1,1,1,0,1,0,1},
	{1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1} };
	for (int i = 0; i < value; i++) {
		for (int h = 0; h < value; h++) {
			if (arr2[i][h] == 1) {
				cout << "+";
			}
			else if (arr2[i][h] == 0) {
				cout << " ";
			}
			else {
				cout << "ОШИБКА!";
			}
		}
		cout << endl;
	}

}

int main() {
	setlocale(0, "");
	cout << "[+] Приветствуем вас в программе функции!" << endl;
	cout << "[+] Выберите один из предложенных вариантов \n[1] Очистка окна консоли \n[2] Изменение цвета фона консоли \n[3] Изменение цвета текста в консоли \n[4] Вывод размера типа данных INT \n[5] Вывод размера типа данных CHAR \n[6] Вывод размера типа данных DOUBLE \n[7] Вывод размера типа данных FLOAT \n[8] Вывод размера типа данных BOOL\n[9] Вывод сообщения  \n[10] Вывод квадрата 5х5 \n[11] Вывод лабиринта 30х30 \n[12] Выход из программы" << endl;
	int menu;
	cin >> menu;
	if (menu == 1) {
		Clear();
		main();
	}
	else if (menu == 2) {
		ColorBackground();
		system("pause");
		main();
	}
	else if (menu == 3) {
		ColorText(menu);
		system("pause");
		main();
	}
	else if (menu == 4) {
		SizeInt();
		system("pause");
		main();
	}
	else if (menu == 5) {
		SizeChar();
		system("pause");
		main();
	}
	else if (menu == 6) {
		SizeDouble();
		system("pause");
		main();
	}
	else if (menu == 7) {
		SizeFloat();
		system("pause");
		main();
	}
	else if (menu == 8) {
		SizeBool();
		system("pause");
		main();
	}
	else if (menu == 9) {
		hello();
		system("pause");
		main();
	}
	else if (menu == 10) {
		square();
		system("pause");
		main();
	}
	else if (menu == 11) {
		maze();
		system("pause");
		main();
	}
	else if (menu == 12) {
		return 0;
	}
	else {
		cout << "Неверно введено значение.";
		system("pause");
		main();
	}
	return 0;
}